{
  "summary": "As a highly motivated and skilled developer with over two years of experience working with React and Python, I am eager to bring my knowledge and expertise to a challenging and dynamic environment. With a strong foundation in both front-end and back-end development, I am confident in my ability to design and implement efficient and effective solutions for a variety of projects. In my previous role, I worked on a variety of projects, including the development of user-friendly interfaces and the integration of APIs to enhance the functionality of applications. I am a quick learner and always looking to improve my skills, and I am excited to continue growing and expanding my knowledge as a junior developer. In my current role, I have been responsible for designing and implementing efficient and effective solutions for a range of projects. I am skilled in using various tools and technologies, including React, Redux, and webpack, and I am always looking to improve my skills and stay up-to-date with the latest developments in the field.",
  "experience": [
    {
      "companyName": "Amazon",
      "jobTitle": "React Developer",
      "startDate": "August 2022",
      "endDate": "December 2022",
      "tags": [ "React", "Javascript", "APIs", "Frontend", "Material UI" ],
      "description": "Responsible for the design of an internal web application focusing on both the user interface by utilizing Material-UI design patterns and API integration with existing Amazon libraries."
    },
    {
      "companyName": "Mathison Projects",
      "jobTitle": "Vue / React Developer",
      "startDate": "April 2021",
      "endDate": "August 2022",
      "tags": ["Vue", "React", "Node", "Frontend", "Backend", "Python", "Data Science"],
      "description": "Starting as an intern, I took a hands-on approach to master frameworks, languages, and software services. This dedication resulted in quickly advancing into a full-time position, working on client-facing corporate contracts. My final project was developing an enterprise financial application utilizing proprietary algorithms developed by the team to conduct automated stock trades."
    },
    {
      "companyName": "ZoomInfo",
      "jobTitle": "Corporate Research Analyst",
      "startDate": "December 2019",
      "endDate": "June 2021",
      "tags": ["Financial Research", "Data Entry"],
      "description": "I provided exclusive scoops to businesses to leverage new information in closing contracts and making necessary adaptations to follow market trends. Working with  I routinely pulled from and helped maintain a database of over one million entries. Alongside this I researched financial information within records from the IRS and notated any changes in the financial status of companies with the database."
    }
  ],
  "education": [
    {
      "schoolName": "Oregon State University",
      "startDate": "Aug. 2022",
      "endDate": "Current",
      "program": "Bachelor's Degree in Computer Science and Mathematics" 
    },
    {
      "schoolName": "University of Virginia's College at Wise",
      "startDate": "Aug. 2014",
      "endDate": "Nov. 2015",
      "program": "Bachelor's Degree in Computer Science" 
    }
  ],
  "technologies": [
    "Amazon Web Services",
    "Typescript",
    "React",
    "Vue 3",
    "Node",
    "Python",
    "Django"
  ],
  "funFacts": []
}